#### Aggregate

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns

In [5]:
df = pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],
                    "value1":[12,54,85,65,92,95],
                    "value2":[100,121,561,651,156,6132]})
df

  Gruplar  value1  value2
0       A      12     100
1       B      54     121
2       C      85     561
3       A      65     651
4       B      92     156
5       C      95    6132

> Aggregate

In [7]:
df.groupby("Gruplar").mean()

         value1  value2
Gruplar
A          38.5   375.5
B          73.0   138.5
C          90.0  3346.5

In [12]:
df.groupby("Gruplar").aggregate([min,max,sum,np.median])

        value1                 value2
           min max  sum median    min   max   sum  median
Gruplar
A           12  65   77   38.5    100   651   751   375.5
B           54  92  146   73.0    121   156   277   138.5
C           85  95  180   90.0    561  6132  6693  3346.5

In [14]:
df.groupby("Gruplar").aggregate({"value1":max,"value2":min}) # Bu şekilde sütunlar için istenilen metodlar çalıştırılır.

         value1  value2
Gruplar
A            65     100
B            92     121
C            95     561

In [20]:
df[df["value1"] == 65].count()

Gruplar    1
value1     1
value2     1
dtype: int64